Table of Contents
 Class ConcreteSLSCheckResultStressLimitationEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
SLS Check Stress Limitation Ec2
public class ConcreteSLSCheckResultStressLimitationEc2 : ConcreteSLSCheckResultStressLimitation
Inheritance
object
ConcreteCheckResultBase
ConcreteSLSCheckResultStressLimitation
ConcreteSLSCheckResultStressLimitationEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 LimitStress
type of SLS limit stress check
public double LimitStress { get; set; }
Property Value
double
 Stress
type of SLS limit stress check
public double Stress { get; set; }
Property Value
double
 TypeCheck
type of SLS limit stress check
public TypeSLSLimitStressCheck TypeCheck { get; set; }
Property Value
TypeSLSLimitStressCheck
 Edit this page